import 'package:flutter/material.dart';
import '../Fargmantes/Phrases_farg.dart';

class PhrasesPage extends StatelessWidget {
  PhrasesPage({
    super.key,
  });
  final List<String> Textpickerall = [
    "كحكاية تتلوها علي امي فأنام بعدما أطمأن قلبي ولكن قلبي لم ينم وظل يقظا يرسل باشارة الي عقلي ويقوم هلا عرضت ما ساتلوه عليك عرضا سينمائيا على هيئة حلم جميل تزيد سعادته اثناء نومه فانه لم يذق طعم السعادة طوال حياته الا الان كانه قد ولد الان ، فيقول اخبرني فيردد قلبي : فتاة اسرتني منه حتى انني لم ادرك ما هذا الفيض كانني غرقت ولم استطع المقاومة او السباحة فاسرتني ثم بدات انظر من خلال الفيض وها انا المح ابتسامتها فاتوقف عن المقاومة ، اتشبس بعامود ع الجانب وانظر فاذا بعينيها تفضحانها بحبها له فيفرح هو ، واسمع ما هذا صدي الصوت ، انه كلامها يا له من كلمات ساحرة اصابتني انا ، وانا في حلمي فقط ابتسم واضحك والسعادة تغمرني ليخبرني عقلي بان القلب قد وجد ضالته فلا تحزن ولا تخب واطمأن فانني والله بعدما رايت لا اتوقف عن التفكير بها",
    "كل تلك الامور ، لو جمعناها في أحجية قصيرة ونقشت على أشد أنواع الصخور لفتش عليها العالم أجمع بعد مر العصور بعد انحدار دينهم وأخلاقهم ، ليرو من الحجر قد شيد قصرا من جمال وصف ما قد نقش وزهي بنفسه وردا ببستانا من عجائب لم توجد ولأصبحت تلك العجائب منبرا يهتدي إليه كل من ضل طريقه في سبيل الكمال",
    "كالراقص على منضدة مطلية بالوان الحب يطلب من الجالسون الاستمتاع بينما يراقص روحه على أغنية تركية ومن ثم يشرع الجالسون باحتساء اولى رشفاتهم من القهوة البنية اللون وما تدارك اخر الليل الا ذهل الجالسون من روعة الرقص وما لبث الا ان توقف الراقص عن أعجوبته معلنا بأن روحه أنت ومن دهشة الرقص نسي الجالسون طعم القهوة لأنهم أدركوا بأن هناك الأسمى ☺",
    "حبّها وحنيني يزداد لها، عشقتها وقلبي يتألم لرؤية دمعها، أفهمها حين أرى عينها، كم تمنيت ضمّها، كم عشقت الابتسامة من فمها، والضّحكة في نبرات صوتها، لا بل الرّائحة من عطرها، سألتها كم تشتاقي لي؟ فأجابت: كاشتياق الغيوم لمطرها، اشتياق الحمامة لعشّها، اشتياق الأم لولدها، اشتياق الليلة لنهارها، اشتياق الزّهرة لرحيقها، بل اشتياق العين لكحلها، اشتياق قصيدة الحب لمتيّمها، بل اشتياق الغنوة للحنها، قلت لها: كل هذا اشتياق؟ قالت: لا، بل أكثر فأكثر، فأنت وحدك حبيبي في الدّنيا كلها، فرحت أتغنّى بسحرها، أغزل كلام الهوى بعشقها، ومن أشعار الهوى أسمعها، لا بل لأجلها أنا حفظتها، فاحترت بم أوصفها، قلبي؟ لا فسوف أظلمها، حبّي؟ ملكتي؟ صغيرتي؟ فكل هذا لا يكفي فأنا في الحب أعبدها، فروح روحي أسكنتها، ومعبودتي في الحب جعلتها، فيا طيور الحب أوصلوا لها، سلامي، حبّي، وبأنّي أنتظرها، يا كل العالم احكوا لها، عشقي، وهيامي، وكم اشتقت لقلبها.",
    "كم أعشقُ تلك النظرات الصامتة التي تُشرق كالشمس من عينيكِ، فتذوّب ملامح وجهي بين ثنايا جفونكِ الغائرة، أعشقُ فيكِ كل شيء عفويتك، غيرتك، قسوتك، رقتك، بسمتك، دمعتك، صمتك، حتّى طريقة جِلستك أعشقها، طريقة مشيتُكِ أعشقها، وكل ما أكرههُ هو مفارقتك، أعشقُ حروف اسمُكِ تحت أسنّة أقلامي، وأغارُ عليكِ من نفسي إن قبّلتُكِ في أحلامي، أغارُ على تلك الخدودِ الوردية التي لطالما غارت منها ورود الربيع، فقلبي بدونكِ عقيمٌ لا يُنجبُ حُبّاً لأحد، وأنا بدونكِ بلا حياة",
    "كما ينبت العشب بين مفاصل صخرة وجدنا غريبين يوما وكانت سماء الربيع تؤلف نجما ونجما وكنت أؤلف فقرة حب لعينيك.. غنيتها أتعلم عيناك أني انتظرت طويلا كما انتظر الصيف طائر ونمت كنوم المهاجر فعين تنام لتصحو عين طويلا وتبكي على أختها، حبيبان نحن، إلى أن ينام القمر ونعلم أن العناق، وأن القبل طعام ليالي الغزل وأن الصباح ينادي خطاي لكي تستمرّ على الدرب يوما جديداً صديقان نحن، فسيري بقربي كفا بكف معا نصنع الخبر والأغنيات لماذا نسائل هذا الطريق لأي مصير يسير بنا؟ و من أين لملم أقدامنا؟ فحسبي، وحسبك أنا نسير معا، للأبد لماذا نفتش عن أغنيات البكاء بديوان شعر قديم؟ ونسأل يا حبنا هل تدوم ؟ أحبك حب القوافل واحة عشب وماء وحب الفقير الرغيف كما ينبت العشب بين مفاصل صخرة وجدنا غريبين يوما ونبقى رفيقين دوما",
    "وانت من اهل الجنة ، وساكنيها كما سكنت قلبي وارتوى بعد ظمأ ، كأن ظلامه الكالح انشقع بعد صبابة قلبك عليه",
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        centerTitle: true,
        backgroundColor: Colors.blueAccent,
        title: Text(
          "What Eye Reading :-)",
          style: TextStyle(
              fontWeight: FontWeight.bold,
              fontSize: 24,
              fontFamily: 'Pacifico'),
        ),
      ),
      body: ListView.builder(
          itemCount: Textpickerall.length,
          itemBuilder: (context, index) {
            return PhrasesCato(
              textpick: Textpickerall[index],
            );
          }),
    );
  }
}
